In [1]:
## Required Imports

import pandas as pd
import numpy as np

In [2]:
## View the expected test results

df =  pd.read_csv('data/gender_submission.csv')
df.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [3]:
## train data
df_train = pd.read_csv('data/train.csv')
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
## test data

df_test = pd.read_csv('data/test.csv')
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [6]:
## Number of Null Values for 1st class cabin passengers
df_train[df_train['Pclass']==1]['Cabin'].isnull().sum()

40

In [7]:
## Number of Null Values for 2nd class cabin passengers
df_train[df_train['Pclass']==2]['Cabin'].isnull().sum()

168

In [8]:
## Number of Null Values for 3rd class cabin passengers
df_train[df_train['Pclass']==3]['Cabin'].isnull().sum()

479

In [9]:
## Unique Classes  among 3rd Class Cabins?
df_train[df_train['Pclass']==3]['Cabin'].unique()

array([nan, 'G6', 'F G73', 'F E69', 'E10', 'F G63', 'E121', 'F38'],
      dtype=object)

In [10]:
## Different ages among 3rd class passengers
df_train[df_train['Pclass']==3]['Age'].unique()

array([22.  , 26.  , 35.  ,   nan,  2.  , 27.  ,  4.  , 20.  , 39.  ,
       14.  , 31.  , 15.  ,  8.  , 38.  , 21.  , 18.  , 40.  , 19.  ,
        7.  , 28.5 , 11.  , 17.  , 16.  , 32.  , 25.  , 30.  , 29.  ,
       33.  , 24.  , 59.  , 28.  , 37.  , 14.5 , 70.5 , 12.  , 45.  ,
       47.  ,  9.  , 55.5 , 40.5 , 44.  ,  1.  , 36.  , 42.  , 34.  ,
       45.5 , 51.  , 20.5 ,  5.  , 41.  ,  3.  , 65.  , 23.5 , 61.  ,
       23.  , 10.  ,  0.75, 50.  , 63.  , 49.  , 43.  , 24.5 , 48.  ,
        6.  , 30.5 , 13.  ,  0.42, 34.5 , 74.  ])

In [24]:
df_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [11]:
## Number of Null Ages
df_train['Age'].isnull().sum()

177

### Treating  Missing Values
#### 1. Continuous Columns
Fill the NaN age values

In [63]:
df_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [87]:
df_train['Age'] = df_train['Age'].fillna(value=df_train['Age'].median())

In [89]:
df_train['Age'].isnull().sum()

0

#### 2. Categorical Columns

In [91]:
df_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Number of  NaN Cabin values

In [92]:
df_train['Cabin'].isnull().sum()

687

Generating a  List of  Passenger Classes

In [93]:
pclass_list = list(df_train['Pclass'].unique())

##### Fillling the  NaN Values among Cabin based on Passenger Class
1. Iterate through Passenger Class
2. Determine  mode of Cabin Number for each Passenger Class
3. Generate a list of  NaN indexes
4. Fill the NaN values basis the NaN indexes

In [135]:
for class_name in pclass_list:
    print (df_train[df_train['Pclass']==class_name]['Cabin'].mode()[0], class_name)
    
    mode_value = df_train[df_train['Pclass']==class_name]['Cabin'].mode()[0]
    null_indexes = list(df_train[df_train['Pclass']==class_name][df_train['Cabin'].isna()==True].index)
    
    for i in null_indexes:
        df_train['Cabin'].iloc[i] = mode_value

G6 3
B96 B98 1
D 2

C:\Users\DELL\Anaconda3\envs\tanush_data_ops\lib\site-packages\ipykernel_launcher.py:5: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """

In [136]:
df_train['Cabin'].isnull().sum()

0

In [137]:
df_train.columns.values

array(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'], dtype=object)

In [143]:
df_train['Embarked'] = df_train['Embarked'].fillna(df_train['Embarked'].mode()[0])

In [145]:
df_train['Embarked'].isnull().sum()

0